       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCTMGMT.

       PROCEDURE DIVISION.
           DISPLAY "====================================="
           DISPLAY "      ACCOUNT MANAGEMENT MODULE      "     
           DISPLAY "====================================="
           DISPLAY "Welcome to your Acct Management. :)"
           DISPLAY "This feature is under development."
           DISPLAY "Press ENTER to return to the main menu."
           ACCEPT OMITTED
           GOBACK.
