       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUTHUSER.

       PROCEDURE DIVISION.
           DISPLAY "====================================="
           DISPLAY "      AUTHENTICATE USER MODULE      "
           DISPLAY "====================================="
           DISPLAY "For user authentication purposes."
           DISPLAY "This feature is under development."
           DISPLAY "Press ENTER to return to the main menu."
           ACCEPT OMITTED
           GOBACK.   
