       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       PROCEDURE DIVISION.
           DISPLAY "Hello, world!".
           DISPLAY "My name is COBOL.".
           STOP RUN.
