       05 S-ID              PIC X(5).
       05 S-NAVN            PIC X(20).
       05 S-ALIASER.
          10 S-ALIAS-1      PIC X(20).
          10 S-ALIAS-2      PIC X(20).
          10 S-ALIAS-3      PIC X(20).
          10 S-ALIAS-4      PIC X(20).
          10 S-ALIAS-5      PIC X(20).
       05 S-FODSEL          PIC X(10).
       05 S-LAND            PIC X(2).
