       05  TR-CPR          PIC X(15).
       05  TR-NAVN         PIC X(30).
       05  TR-ADRESSE      PIC X(50).
       05  TR-FODSEL       PIC X(10).
       05  TR-KONTO-ID     PIC X(15).
       05  TR-REG-NR       PIC X(4).
       05  TR-BELOEB-RAW   PIC X(11).
       05  TR-VALUTA       PIC X(3).
       05  TR-TYPE         PIC X(15).
       05  TR-BUTIK        PIC X(20).
       05  TR-TIMESTAMP.
           10 TR-DATE      PIC X(10).
           10 FILLER       PIC X(16).

